Tekla.Structures.Dialog.FormBase
The FormBase class is the base class for all Tekla Structures dialogs.
The class provides localization, unit conversion and data storage
(temporary and file-based) among other things.

Tekla.Structures.Dialog.FormBase.structuresExtender
An extender for binding controls to data types. The bindings are needed to transfer dialog values
to Tekla Structures and onwards to plug-ins.

Tekla.Structures.Dialog.FormBase.#ctor
The default constructor that does not need parameters.
Initializes the form and registers property bindings.

Tekla.Structures.Dialog.FormBase.Dispose(System.Boolean)
Cleans up any resources that are being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.FormBase.Localization
The localization instance for the dialog. Each dialog has its own localization instance
that has read the localization files needed for that dialog.

Tekla.Structures.Dialog.FormBase.DialogAttributeTypes
Gets the names and types of all the fields that have proper tags. The type is read from the tag.

Tekla.Structures.Dialog.FormBase.FormInitialized
Run after the form has been initialized.

Tekla.Structures.Dialog.FormBase.InitializeForm
Prepares the data storage for the dialog and scans through the fields.

Tekla.Structures.Dialog.FormBase.InitializeDataStorage
Prepares ONLY the data storage.

Tekla.Structures.Dialog.FormBase.GetAttributeManager
Returns the data storage.

Tekla.Structures.Dialog.FormBase.InitializeDistanceUnitDecimals
Gets the number of decimals Tekla Structures uses for displaying the "length" unit and
initializes the distance datatype to use that.
Returns: True if successful. False if failed.

Tekla.Structures.Dialog.FormBase.InitializeAngleUnitDecimals
Gets the number of decimals Tekla Structures uses for displaying the angle unit and
initializes Tekla.Structures.Datatype.Angle class to use that.
Returns: True if successful. False if failed.

Tekla.Structures.Dialog.FormBase.InitializeUnitDecimals
Gets the number of decimals Tekla Structures uses for displaying its units and
initializes the Tekla.Structures.Datatype classes to use them.
Returns: True if successful. False if failed.

Tekla.Structures.Dialog.FormBase.GetUnitDecimals(Tekla.Structures.Dialog.dotdiaUnitTypes_e)
Gets the number of decimals Tekla Structures uses with the specified unit type.
unit: The specified unit type.
Returns: The number of decimals used, 0 (no decimals or invalid unit type) or -1 (failed).

Tekla.Structures.Dialog.FormBase.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established.
Currently, there's no way to re-establish the connection.
Returns: True on success.

Tekla.Structures.Dialog.FormBase.ShowForm
Displays the form.

Tekla.Structures.Dialog.FormBase.Apply
The method to call when the Apply button is clicked. Stores the current dialog
values to the dialog data storage.

Tekla.Structures.Dialog.FormBase.Modify
The method to call when the Modify button is clicked.

Tekla.Structures.Dialog.FormBase.Create
The method to call when the Create button is clicked.

Tekla.Structures.Dialog.FormBase.RegisterPropertyBinding(System.Type,System.String)
Registers a binding for a control type. The bindings allow automatic formatting and
field update events among other things. Needs to be called in the constuctor.
type: The type of the control.
propertyName: The name of the property.

Tekla.Structures.Dialog.FormBase.RegisterPropertyBinding(System.Type,System.String,System.Windows.Forms.DataSourceUpdateMode)
Registers a binding for a field type. The bindings allow automatic formatting and
field update events among other things.
type: The type of the control.
propertyName: The name of the property.
updateMode: The event upon which to update the field.

Tekla.Structures.Dialog.FormBase.RegisterAttribute(System.String,System.Type)
Registers an attribute without binding to a control.
AttributeName: The name of the attribute to be created.
ReturnType: The attribute type that will be returned.

Tekla.Structures.Dialog.FormBase.RegisterAttribute(System.String,System.Type,System.Boolean)
Registers an attribute without binding to a control and a filter.
AttributeName: The name of the attribute to be created.
ReturnType: The attribute type that will be returned.
CreateFilter: The create filter for the attribute.

Tekla.Structures.Dialog.FormBase.RegisterFilterControl(System.String,System.Windows.Forms.Control)
Registers a control to filter an attribute.
AttributeName: The name of the attribute to filter.
FilterControl: The control that will be the filter.

Tekla.Structures.Dialog.FormBase.ReadFromDataStorage(Tekla.Structures.DialogInternal.DialogDataStorageBase)
Gets the values from the given data storage and sets the values for the
visible fields accordingly.
dataStorage: The data storage to read from.

Tekla.Structures.Dialog.FormBase.WriteToDataStorage(Tekla.Structures.DialogInternal.DialogDataStorageBase,System.String)
Writes the values from the shown dialog to the given data storage.
dataStorage: The data storage to write to.
dialogname: The name of the dialog for the variable information.

Tekla.Structures.Dialog.FormBase.UpdateValues
Rereads and updates all the field values on the form.

Tekla.Structures.Dialog.FormBase.ToggleSelection
Checks or unchecks all the enable check boxes.

Tekla.Structures.Dialog.FormBase.LoadValuesPath(System.String)
Retrieves the full path for the file name. Called from LoadValues.
Override this function in order to change the default load path OR to add additional
actions on LoadValues.
FileName: The name of the file.
Returns: The full path together with the file name.

Tekla.Structures.Dialog.FormBase.ApplyValues(System.String)
Loads the dialog values from a file and performs Tekla.Structures.Dialog.FormBase.Apply on the loaded values.
To match the files to a certain dialog, the file suffix is set as the dialog type's name.
FileName: The name of the file.

Tekla.Structures.Dialog.FormBase.LoadValues(System.String)
Loads the dialog values from a file. To match the files to a certain dialog,
the file suffix is set as the dialog type's name.
FileName: The name of the file.

Tekla.Structures.Dialog.FormBase.ModifyValues(System.String)
Loads the dialog values from a file and performs Tekla.Structures.Dialog.FormBase.Modify on the loaded values.
To match the files to a certain dialog, the file suffix is set as the dialog type's name.
FileName: The name of the file.

Tekla.Structures.Dialog.FormBase.LoadValues(System.String,Tekla.Structures.Dialog.FormBase.ApplyModifyDelegate)
Loads the dialog values from a file. To match the files to a certain dialog,
the file suffix is set as the dialog type's name.
FileName: The name of the file.
applyModifyDelegate: The function to perform on the loaded values.

Tekla.Structures.Dialog.FormBase.SaveValuesPath(System.String)
Retrieves the full path for the file name. Called from SaveValues.
Override this function in order to change the default save path OR to add additional
actions on SaveValues.
fileName: The name of the file.
Returns: The full path together with the file name.

Tekla.Structures.Dialog.FormBase.SaveValues(System.String)
Serializes the dialog values to an xml file.
fileName: The path of the file.

Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object)
Sets a value for the given control. When the dialog is not shown, setting a property
directly for a control (such as textBox1.Text = "text") will not work for controls that
have a Tekla Structures AttributeTypeName set. This method is going to have to be used
to set the value.
Ctrl: The control whose value to set.
Value: The new value. It can be of any primitive datatype supported by the
control's AttributeType (normally int, double or string).
The following example shows how to use Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object):
using System;
using System.Windows.Forms;
using Tekla.Structures.Dialog;
using Tekla.Structures.Dialog.UIControls;
public class Example : PluginFormBase
{
private void MaterialCatalogSelectionDone(object sender, EventArgs e)
{
materialTextBox.Text = materialCatalog.SelectedMaterial;
SetAttributeValue(materialTextBox, materialCatalog.SelectedMaterial);
}
private TextBox materialTextBox = new TextBox();
private MaterialCatalog materialCatalog = new MaterialCatalog();
}

Tekla.Structures.Dialog.FormBase.SetFilterValue(System.String,System.Boolean)
Sets a filter value for the given attribute. This method is needed for filter the attributes
which cannot be set from UI control.
AttributeName: The name of the attribute to be set.
Value: The new value set to the attribute.

Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.String,System.Object)
Sets a value for the given attribute. This method is needed for attributes which are not
bound to a control.
AttributeName: The name of the attribute to be set.
Value: The new value set to the attribute.

Tekla.Structures.Dialog.FormBase.GetAttributeValue``1(System.Windows.Forms.Control)
Gets a value for the given Ctrl from the data storage. The return type can be set to
a primitive type such as int, double or string.
The type of the returned variable.
Ctrl: The control whose value to get.
Returns: The value set for the Ctrl in the requested datatype.

Tekla.Structures.Dialog.FormBase.GetFilterValue(System.String)
Gets the filter value for the given attribute. This method is needed for attributes which are not
bound to a control or hidden in UI.
AttributeName: The name of the attribute.
Returns: The value gotten for the attribute filter.

Tekla.Structures.Dialog.FormBase.GetAttributeValue``1(System.String)
Gets the value for the given attribute. This method is needed for attributes which are not
bound to a control.
The type of the returned variable.
AttributeName: The name of the attribute.
Returns: The value gotten from the attribute.

Tekla.Structures.Dialog.FormBase.RegisterAkitForm(System.String)
This is used ONLY for testing, MUST not be included in any release.
Used for recording macros from .net applications.
name:

Tekla.Structures.Dialog.FormBase.UnregisterAkitForm
This is used ONLY for testing, MUST not be included in any release.
Used for recording macros from .net applications.